Revit 2027 API
ParameterTypeId.RbsPipeTypeParam Property
 "Pipe Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeTypeParam { get; }
Public Shared ReadOnly Property RbsPipeTypeParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeTypeParam {
	ForgeTypeId^ get ();
}
static member RbsPipeTypeParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace